# HW 2
a = float(ввод())
если a в диапазоне (11, 22) или a в диапазоне (30, 40):
 print("точка в диапозоне")
else: print("точка не в диапозоне")

a = float(ввод())
b = float(ввод())
если (a в диапазоне (-5, 1) и b в диапазоне (-5, 1)) или (b в диапазоне (3,8) и a в диапазоне (3,8)):
 печать ("да")
остальное: печать ("нет")

S = float(ввод())
t = float(ввод())
V = S/t
если V < 30:
 print('медленно')
если V> 30 и V <60:
 print('средне')
else: print("быстро")


k = int(ввод())
a = k//100
b = k//10%10
c = k%10
A = max(a, b, c)
B = min(a, b, c)
C = a + b + c-A-B
если A-B == C:
 print('число n "интересное"')
else: print('число n "не интересное"')

print('задание 5')

a = str(ввод())
если len(a)>15:
 print('Ник-нейм должен состоять максимум из 15 символов!')
elif len(a)<3:
 print("Ник-нейм должен состоять минимум из 3 символов!")
else: print("ник принят")

print("задание 6")
print('ведите х, не равный нулю')
x = float(ввод())
print('введите у, не равный нулю')
y = float(ввод())
если x> 0 и y> 0:
 print('точка принадлежит первой четверти')
 print('Введите 2 строки')
 a = str(ввод())
 b = str(ввод())
 печать(min(a,b))
если x < 0 и y > 0:
 print('точка принадлежит второй четверти')
 f = ((2 * abs(x)-y) / y**2)
 печать (f)
если x < 0 и y < 0:
 print('точка принадлежит третьей четверти')
 print('Введите строку')
 печать(x * len(str(ввод())))
 печать(y * len(str(ввод())))
ещё:
 print('точка принадлежит четвёртой четверти')
 если abs(x)> abs (y):
 print('х большая по модулю')
 элиф абс (y) > абс (x):
 print('у большая по модулю')
 ещё:
 print('координаты равны по модулю')

print('задание 7')
a = str(ввод())
if "кот" or "Кот" in a:
 print('Мы погладили кота!')
